#Область ОбработчикиСобытийФормы

	// ++ 2026.02 Ливенцев правки 
	//Добавляет новые элементы на форму програмно
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДобавитьНовыеЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	УстановитьВидимость(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьНовыеЭлементыФормы()
	
	// Создание групп
	Если Элементы.Найти("АдоненскоеОбслуживание") = Неопределено Тогда
		АдоненскоеОбслуживание = Элементы.Добавить("АдоненскоеОбслуживание", Тип("ГруппаФормы"),ЭтотОбъект);
		АдоненскоеОбслуживание.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		АдоненскоеОбслуживание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
		АдоненскоеОбслуживание.ОтображатьЗаголовок = Ложь;
		АдоненскоеОбслуживание.Отображение = ОтображениеОбычнойГруппы.Нет;
		
		АдоненскоеОбслуживаниеСтоимость = Элементы.Добавить("АдоненскоеОбслуживаниеСтоимость", Тип("ГруппаФормы"),ЭтотОбъект);
		АдоненскоеОбслуживаниеСтоимость.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		АдоненскоеОбслуживаниеСтоимость.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
		АдоненскоеОбслуживаниеСтоимость.ОтображатьЗаголовок = Ложь;
		АдоненскоеОбслуживаниеСтоимость.Отображение = ОтображениеОбычнойГруппы.Нет;
	КонецЕсли;
	
	Если Элементы.Найти("ДатаНачала") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ДатаНачала", Тип("ПолеФормы"),АдоненскоеОбслуживание );
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеПериода;
		НовыйЭлемент.Заголовок = "Дата начала";
	КонецЕсли;
	
	Если Элементы.Найти("ДатаОкончания") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ДатаОкончания", Тип("ПолеФормы"),АдоненскоеОбслуживание );
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеПериода;
		НовыйЭлемент.Заголовок = "Дата окончания";
	КонецЕсли;
	
	Если Элементы.Найти("СуммаАбонентскойПлаты") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"),АдоненскоеОбслуживаниеСтоимость);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Сумма";
	КонецЕсли;
	
	Если Элементы.Найти("СтоимостьЧасаРаботы") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), АдоненскоеОбслуживаниеСтоимость);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Стоимость часа";
	КонецЕсли;
	
	УстановитьВидимость(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(Форма)
	Форма.Элементы.АдоненскоеОбслуживаниеСтоимость.Видимость = Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание");
	Форма.Элементы.АдоненскоеОбслуживание.Видимость = Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание");
КонецПроцедуры
	// -- 2026.02 Ливенцев правки
	
#КонецОбласти
