#Область СлужебныеПроцедурыИФункции

//Добавление новой кнопки "Заполнить"
Процедура ДобавитьДополнительныеЭлементыФормы(Форма)Экспорт
	
	КомандаЗаполнить = Форма.Команды.Добавить("Заполнить");
	КомандаЗаполнить.Действие = "КомандаЗаполнить";
	КомандаЗаполнить.Заголовок = "Заполнить абнонеское обслуживание";
	
	КнопкаЗаполнить = Форма.Элементы.Добавить("КнопкаСформироватьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
	КнопкаЗаполнить.ИмяКоманды = "Заполнить";
	
КонецПроцедуры

//Проверка заполнения документа РеализацияТоваровУслуг
Функция ПроверкаДанныхИзДоговора(Знач Объект)Экспорт
	
	Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
		ТекстСообщения = "Не указан договор";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Объект.Ссылка,"Объект.Договор","Объект.Договор");
		Возврат Ложь;
	КонецЕсли;
	
	ДатаНачалИДатаОкончанияДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор,"ВКМ_ДатаНачалаДействияДоговора,ВКМ_ДатаОкончанияДействияДоговора");
	Если ДатаНачалИДатаОкончанияДоговора.ВКМ_ДатаНачалаДействияДоговора > Объект.Дата Или ДатаНачалИДатаОкончанияДоговора.ВКМ_ДатаОкончанияДействияДоговора < Объект.Дата Тогда
		ТекстСообщения = "Договор не дейстителен на дату документа";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.Договор");
		Возврат Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор,"ВидДоговора") <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		ТекстСообщения = "Нет договора абонентского обслуживания";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.Договор");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
