
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДиограммаГанта.Очистить();
	ДиограммаГанта.Обновление = Ложь;

	Если Не ЭтоАдресВременногоХранилища(Параметры.Адрес) Тогда
		ТекстСообщения = "Ошибка получения данных для построения графика";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ГрафикОтпусков = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	Для Каждого Строка Из ГрафикОтпусков Цикл
		
		ТочкаДиограммы = ДиограммаГанта.УстановитьТочку(Строка.Сотрудник);
		ТочкаДиограммы.Текст = Строка.Сотрудник;
		СерияДиограммы = ДиограммаГанта.УстановитьСерию("Отпуск");
		СерияДиограммы.Текст = "Отпуск";
		
		Значение = ДиограммаГанта.ПолучитьЗначение(ТочкаДиограммы, СерияДиограммы);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти