
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Период не заполнен";
		Сообщение.Поле = Объект.Период;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("Период", Объект.Период);
	ПараметрыЗапуска.Вставить("Ответственный", );
	
	СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
	
	ПараметрыОжидания  = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал 	= 2;

	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект), ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
	НаименованиеЗадания = "Запуск длительной операции";
	ВыполняемыйМетод = "Обработки.ВКМ_МассовоеСозданиеАктов.ЗаполнениеТабличнойЧастиМассовогоСозданияАктов";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, ПараметрыЗапуска.Период); 
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьДанные(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	Иначе
		
		МассивСозданныхДокументов = ПолучитьИЗВременногоХранилища(Результат.АдресРезультата);
		
		Если МассивСозданныхДокументов.Количество() = 0 Тогда
			ТекстСообщения = "Договоры без акта реализации за данный месяц не найдены";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Объект.ВыполненныеРаботы.Очистить();
		
		СозданоАктов = 0;
		
		Для Каждого Структура из МассивСозданныхДокументов Цикл
			
			СозданоАктов = СозданоАктов + 1;
			НоваяСтрока = Объект.ВыполненныеРаботы.Добавить();
			НоваяСтрока.Договор = Структура["Договор"];
			НоваяСтрока.ДокументРеализации = Структура["ДокументРеализации"];
			
		КонецЦикла;
		
		ТекстСообщения = СтрШаблон("Созданно %1 акт(ов) (реализация товаров и услуг)", СозданоАктов);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти