#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_ОтправкаСообщенийВТелеграмм() Экспорт
	
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	ИдентификаторЧата = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	Если Не ЗначениеЗаполнено(ИдентификаторЧата) Тогда
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Сообщение в телеграмм не отправлено", УровеньЖурналаРегистрации.Ошибка,,,
		"Идентификатор чата не установлен");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Токен) Тогда
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Сообщение в телеграмм не отправлено", УровеньЖурналаРегистрации.Ошибка,,,
		"Токен не установлен");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Ответ = ОтправитьСообщение(Выборка.ТекстСообщения, Токен, ИдентификаторЧата);
		Если Ответ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Ответ.КодСостояния = 200 Тогда
			УведомлениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			УведомлениеОбъект.Удалить();
		Иначе
			ОписаниеОшибки = Ответ.ПолучитьТелоКакСтроку();
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Сообщение в телеграмм не отправлено", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОтправитьСообщение(Знач ТекстСообщения, Знач Токен, Знач ИдентификаторЧата)
	
	Попытка
		Соединение = Новый HTTPСоединение("api.telegram.org",,,,,, ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
		ДанныеСообщения = Новый Структура;
		ДанныеСообщения.Вставить("text",ТекстСообщения);
		ДанныеСообщения.Вставить("chat_id",ИдентификаторЧата);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON,ДанныеСообщения);
		СообщениеДляОтправки = ЗаписьJSON.Закрыть();
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("content-type", "application/json");
		АдресURL = СтрШаблон("/bot%1/sendMessage", Токен);
		HTTPЗапрос = Новый HTTPЗапрос(АдресURL, Заголовки);
		HTTPЗапрос.УстановитьТелоИзСтроки(СообщениеДляОтправки);
		Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Сообщение в телеграмм не отправлено.",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

